ToCrieit/MathLogic/learning_about_logic.md

# Table of Contents

1.  [筆者のスペック](#org27f42a2)
    1.  [小学生の筆者](#org090d38c)
    2.  [中学生の筆者](#org5a0381f)
    3.  [高校生の筆者](#orgd2fe5ce)
2.  [論理学に興味を持った理由](#org5174db1)
    1.  [専門学校生の時に行った「Sapporo RubyKaigi 」で知った「禅とオートバイ修理技術」](#org9c6d994)
    2.  [一番強い「Ubuntu Japanese Team の通称『黒幕』氏の助言など](#org0a14bef)
    3.  [2020 年頃からの「論理的思考を養うためのプログラミング教育」や「深層学習(機械学習)」の思想](#orge66532f)
    4.  [実は「本当にキッカケとなった」ブログ記事がある](#org3a94062)
3.  [数理論理学に入門する前の漠然とした意識や認知](#orgd65021e)
    1.  [世の中『数値』で表しにくい事が多い気がする](#org2026f19)
        1.  [『1』とは？](#orgf724b4d)
    2.  [『算数』という名の『国語』の問題](#org180ddf1)
4.  [数理論理学と逢えて](#org9aeb7d6)
    1.  [論理結合子は 5 つしか無い](#orge458c6b)
    2.  [述語と量化子とラムダ式](#org1e7ef10)
    3.  [与太話: 全称記号と 2000 年代の日本のインターネッツ](#org90444ef)
    4.  [閑話休題: ここまでのまとめ](#org2f2a707)
5.  [「しかしそれは薄情・無情では無いか？」](#org6f6fd68)
    1.  [バートランド・ラッセルの語録](#orgd93c9d0)
        1.  [悪の定義と、悪の側からの「正義」という詭弁と正当化](#orge6e494a)
        2.  [とは言え、「不幸な人間」が「不幸」を解くには](#orgac01485)
6.  [まとめ: 論理学を薦める、とても感情に偏った理由](#org78d775c)
7.  [蛇足](#org8b7cac2)
    1.  [筆者の認知特性](#orgb945758)
    2.  [言葉を『解く』為の「論理学」「哲学」](#orgf079196)
8.  [参考資料](#orgfb9be9e)
9.  [謝辞](#org7a10435)
10. [変更履歴](#org4eb1862)

ぶっちゃけ、ほぼ何も考えずに DOOM Emacs を起動して書き初めた。
いや、下書きの下書きのコピー用紙への殴り書きはある。

この記事は、
「他人が何かを学習するにあたり、その学習する対象への興味を持たせたら良い気がする。なので自分が数理論理学を学んで『楽しかった事』や『感動した事』を書き連らねれば、
自分が楽しいと思えた数理論理学を他の人も興味を持ってくれるのでは。持ってくれるととても有り難い」
という動機・モチベーションで書いた、ポエム(詩ではない何か)である。


<a id="org27f42a2"></a>

# 筆者のスペック

学歴だけ摘み取って上げ足を取るなら、筆者は大学院や大学ではなく高等専門学校でもない専門学校を卒業した程度で、
「専門士」でしかない。「博士」や「修士」じゃない。

前書きの動機に至った理由としては、筆者が高校を卒業し、専門学校でコンピューターによる情報処理に必要な数学・論理学を授業で再学習をして理解ができ、
その後社会人になって論理学の知識を「深層学習」や「機械学習」、「関数型パラダイム」という言葉で必要性を改めて認識して学習を始めたら、
妙に楽しいと思えたからである。

以下、しばらく筆者が「どれだけ算数・数学・論理学が出来なくて嫌いだったか」を書き連ねる。


<a id="org090d38c"></a>

## 小学生の筆者

酷い話で、数直線の理解ができてなかったのだろうと今は振り返る。

数直線が読めていたとしても、そこに日本語で数直線に対する問題を出題されると、誤答が多かった記憶である。

「数直線うんぬんの前に、日本語の理解が無いのでは？」   
おそらく確実にその通りである。

文章題は解き方を説明されながら解けるものの、いざ実践で自力のみで行うと途端に解けない。

それ以前に、テストで文章題に辿りつく前の基本問題で時間を使い果していた記憶である。


<a id="org5a0381f"></a>

## 中学生の筆者

未だに強く印象に残っているのは、   
「二次元グラフに置いて、x,y の変数に対応する軸を当て違えて 2 年以上過ごしていた」   
事である。そのおかげで数学は赤点常連組みであった。

その割には、図形の合同証明や相似証明は妙に好きであった。
*「好き」が必ずしも「成績」には直結しない前提は付くので、成績はお察しの通りである*

上述を楽観するならば、こういった証明問題が好きだからプログラミングに興味を持てたのかもしれない。


<a id="orgd2fe5ce"></a>

## 高校生の筆者

しかし、高校時代は本当に数学の全てが嫌になった様に思う。別に教員が悪い訳ではない。筆者の認知というべきか、
論理面での理解・解釈方法が遅れていたと思える。/と言い訳する/

特に「集合」の問題がてんで駄目であった。高校生の記憶はまだ新しいので違和感まで再現して分析できるが、
その違和感を分析してみれば、   
「『問題の対象・関心』と『問題では扱わない対象・関心』を切り分けられず、苦心していた」   
とも取れるし、   
「複合命題を前提とした集合演算を読み解けなかった」   
とも取らえれる。

やはり、論理というべきか日本語の読み解きの力が無かったのか。その割には文芸的な文書からの、   
「出題文書の筆者の心情を読み取れ」   
の類いは無駄に成績が良かった記憶。

---

と、そんな筆者がなぜ   
「この背景や経歴を見ても明らかなくらいに論理が苦手なのに数理論理学を学んで感動したのか」   
という事を書いて行こう。


<a id="org5174db1"></a>

# 論理学に興味を持った理由

たくさんきっかけは逢った<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> と思う。


<a id="org9c6d994"></a>

## 専門学校生の時に行った「Sapporo RubyKaigi 」で知った「禅とオートバイ修理技術」

まず一番は[2010 年のこれ](http://regional.rubykaigi.org/sapporo03/)だろう。その Kaigi で最後のセッション、角谷信太郎氏の「[There is No Spoon:Revisited](https://www.slideshare.net/kakutani/there-is-no-spoon-revisited)」の中で紹介されていた。

*筆者が「専門学校では VB.net で授業を受ける Pythonista 未満であった」事は脇に置いてくれ……*

時は流れて 2019 年に「禅とオートバイ修理技術」を購入したが、その著者であり主人公であり語り手である
ロバートの論理のナイフによる問題や定理・定義のバラし方には目を見張るものがあった。

それについては[過去に Crieit で感想文を書いた](https://crieit.net/posts/ZenAndTheArtOfMortorcycleMeintenance-0-read)が、今回改めてその「論理のナイフ捌き」について語ろうか……、

とも思ったが、素直な話をしてしまえば、 *今、筆者自身の事をそう思うからなのだろうけど* これは筆者の拙くて幼稚な解釈でそれについて語るより、読者が実際に「禅とオートバイ修理技術」を読んで感じた方がよっぽど良いと思う所存である。なので書かない、いや書けない。


<a id="org0a14bef"></a>

## 一番強い「Ubuntu Japanese Team の通称『黒幕』氏の助言など

とはいえ、「禅とオートバイ修理技術」を実際に買って読むまで *いや、今でもか……* 、自分が今書いた文の文節・単語の前後関係が支離滅裂で、それに全く違和感を抱かずに Twitter に投稿し続けていた。

そんな阿呆なので、某氏からリーナス・トーヴァルズの 10 倍希釈の論理添削をよく *今でもごく稀に* 頂いていて、
そのまま筆者に対して呆れ果てて良いものを、わざわざ筆者に野矢茂樹著「論理トレーニング 101 題」を買ってくれた訳である。

実は未だに一度も読み通せておらず、まだ 3 分の 1 も読み終えて無いのではないと記憶している。

しかし、それだけ読んでもナマクラどころか棍棒同然の筆者の論理のナイフは、やっと錆びたペーパーナイフくらいにはなった気はする。
*と書けば某氏は「あー、まだこいつやっぱり阿呆だわ……なんでこいつこんなに学習しないのだろう」と呆れ果てるだろうと容易に想像するが*

読者に、   
「某氏の事を随分恨んでるなあ」   
と思わせてしまったなら、それは正に筆者の表現力・語彙やその言葉の選択が幼稚で白痴だからだ。
文語表現の乏しさは何においても筆者の周りで下手に出る者は居ないだろうという自負はある。

まどろっこしく述べたが、感謝している。ただ完全に言い訳だが、筆者がヘソ曲がりなので純粋に感謝の言葉を並べても、その言葉の列には言外の意図 <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>が伝わらなくてもどかしい思いになるのでこうなった。


<a id="orge66532f"></a>

## 2020 年頃からの「論理的思考を養うためのプログラミング教育」や「深層学習(機械学習)」の思想

して、そんな筆者に追い打ちをかけるかの様に到来したのが「プログラミング教育」だったり「深層学習」のパラダイム、それと少しの関数<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> 型パラダイムの言語の n 回目の流行り<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> である。

筆者は *他のメンター各位には煙たがれていると思うし、門下生にも「面倒臭い」と思われているだろうが* 密かに [CoderDojo](https://coderdojo.com/ja-JP) のメンター活動をさせて頂いているので、
「プログラミング教育」には/ 今思うと、むしろ今でも敏感過ぎる程に/ 感じ、思うところがあったもので、[Crieit にも色々散文を書き散らしては公開している](https://crieit.net/users/manzyun)。

しかし、ここで「深層学習」という *想像力を世の中を渡り歩いて生きて行く為にかなぐり捨てた者達が妙に上げ諂う* **関数の重ね掛けのアプローチ** が妙にもてはやされる様になったのではあるが、
これも雑にバラすと関数の重ね掛けなので、その複合演算・複合演繹の膨大な入力とその結果を全て網羅できなくても、そこに含まれている関数の一つ一つなら理解できる……かも知れないという持論の上で、
脇に大分逸れた様な発想ではあるが、数理論理学の森というのか深淵に踏み入ってしまった訳である。


<a id="org3a94062"></a>

## 実は「本当にキッカケとなった」ブログ記事がある

筆者の語彙の無さと記憶力の無さには我ながらうんざりするが、成人してからずっと、   
「『論理的思考能力』とは言うが、一体どうやって皆は学んだのだろう。実戦 *という世の中* で鍛錬したと言うなら、自分はそれ以前なのだが……」   
と思って  Google か [DuckDuckGo](https://duckduckgo.com/) したかさえ忘れたが、その検索結果に引っ掛ったブログ記事で「『数理(記号)論理学』を学んでからの実践の提案と、足掛りとなる書籍の紹介」
がされていたので一通り買ってしまったという具合だった記憶がある。 *そのブログの著者には感謝を伝えたいが失念したためにそのブログを見つけ出すのも叶わない有様だ*

そのブログ記事では他にも「詭弁論理学」と「逆説論理学」の紹介もされていたのでそれらも買っている。ただしまだ開いてさえもいない。


<a id="orgd65021e"></a>

# 数理論理学に入門する前の漠然とした意識や認知

ここまでで大分「筆者が『数理論理学』に入門した経緯」については書いたので要らないかもしれないが、もう少し。


<a id="org2026f19"></a>

## 世の中『数値』で表しにくい事が多い気がする

これは筆者自身の「数学」という言葉に対する認知バイアスもあってとは思うが、   
「数値で表すには違和感のある概念 \*も\*『数学』には含まれている」   
と今は言語化できてるが、今以前はそれが言語化できなかったし、けれどもその違和感をなおざりにして数学を学ぼうとしていたためか、
その違和感によって『数学』はどんどん霞み・霧が濃くなって見失う様な感覚を覚えていた気がする。


<a id="orgf724b4d"></a>

### 『1』とは？

> 「仲間のなかには」と老先生が言った。「ボッケル先生より、ずうっと苦労している悪魔がおる。たとえばわたしの同僚で、
> 年配のイギリス人のラッセル卿は、あるとき、1+1=2 を証明しようと決心した。ほら、この紙切れに写しておいたが、
> これがラッセル卿のやった証明じゃ」
> 
> (…図省略…)
> 
> 「うひゃっ!」ロバートは身ぶるいした。「ぞっとするね。こんなことして、なんの役に立つの? 1+1=2 なんて、ぼくだって知っているのに」
> 
> 「ああ。ラッセル卿だって知ってたよ。だが、もっときちんと知りたかった。で、こういうことになったわけだ。(……後略……)

/著:エンツェンスベルガー, 訳:丘沢静也 「普及版 数の悪魔 算数・数学が楽しくなる 12 夜」の「第 11 夜 『証明はむずかしい』」より抜粋<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> /

これは非常に極端な例とは思うし、筆者も数理論理学においての語彙や構文解析能力が乏しいため、理解には至っていない。
しかし、筆者個人の感想としては、   
「この様に論説の展開を記号に変換してしまう事で、 **言外の意味を組み取らせない、する必要の無いものになった** 」   
と想い抱く。

ましてや、筆者はこういった論理学者や哲学者の論説やその論説に至る経緯を読む程に *自惚れではあるとは思うが* 、
「この人達はきっと煙に巻く様な言い回しに違和感を抱き続けていたからこそ、こういう事を突き詰めていたのだろう」   
と、感銘や共感の念を抱いてしまうのである。

しかし、筆者にある問題は他にも大沢山あるとは承知の上ではあるが、こういう、   
「いちいち細かい事が気になり過ぎてしまう」   
質の者というのは、世の中に馴染み難かったりする。

---

と文芸的な事を述べたっておそらく「筆者が何に違和感を抱くのか」の具体例でも示さないと強く伝わらないものと思うので、
ここでごくごく普通の小学 1 年生の算数の問題を筆者なりに出題してみる。


<a id="org180ddf1"></a>

## 『算数』という名の『国語』の問題

> 赤いりんごが 3 コ、緑色のりんごが 6 コあります。全部でりんごはなんコあるでしょう？

ここまで読んで頂いた読者ならこの問題の答えも「9コ」と即答できるだろう。

ただ、筆者の頭の中ではこんな映像が描画されてしまうのである。

1.  赤い りんご が 3 つ 在る映像
2.  上記とは別の場面で 緑色の りんご が 6 つ 在る映像

そしてこの後の文を読んで、「全部でりんごは……」と書かれている物だから、   
「赤いりんごが 3 つある映像と緑色のりんごが 6 つある映像」
を再生成する。その上で数を数えていた。 *筆者が小学 1 年生の時の考え方を想い返しての文章起こしだが*

まだこれは単純な問題ではあるが、これが 25 歳の頃に通っていたメンタルクリニックで受けた知能テストを例に上げるなら;

> 32 たす 58 は？

と口頭で心理士さんに出題されると、頭の中で丁寧に数字を描画してそれを筆算の図に変換しているうちに数値を失念して計算ができなくなる。

そしてこれは今でもそうなのだが、口頭会話が本当に苦手で、特にディベートなどの議論・討論の場ならともかく、口頭での伝達や意識合わせという類い
でも厄介な事に筆者の頭の中では、

-   音声情報の形態素解析
    -   未知語があれば分解して類語が無いか探す
        -   脳内で未知語を定義した上で解釈し、未知語で返答する
        -   該当する類語が無ければ聞く
    -   形態素の前後から相手の抱いている言外の意図を組み取る
-   相手の表情を見て意図を組み取る

という事を並列で行わざる負えないし、さらに厄介なのは形態素解析が 2 次元展開されて、最終的には 3 次元や時間軸で変化する映像を、シークバーを操作する様に言葉から演算される情景やグラフ図ができているのである。

むしろ他人がどの様に口頭での会話が脳内で展開されているか知りたいものの、知ってもおそらく自分はこの展開方法が身に焼き付いてしまっているので、
別のパラダイムへの矯正は困難にしか思えないのが本音である。

付け加えるなら、それこそ数理論理学に入門するまで自他の書いた日本語の文章での関心の対象だったり形態素解析が全くできてないため、支離滅裂な SNS への投稿を   
*今でも気を抜くとそうだが* してしまうのである。


<a id="org9aeb7d6"></a>

# 数理論理学と逢えて

そんな筆者が数理論理学と逢えて良かったと思うのはやはり   
「自然言語に上げ難く、発音する余地も無い記号を用いて論理構造や立証の展開や演繹を行う事ができる様になった」   
というのはある。
