ToCrieit/MathLogic/learning_about_logic.org
** 論理結合子は 5 つしか無い

論理結合子は *5 つしか* 定義されていないのである。またそれらは容易にプログラミング言語に書き替える事が可能である。

下記では筆者の好みにより、Python と比較する:

+ 否定(ひてい) :: ~not A~ 相当。変数や式の頭に =¬= という記号を付ける ( =¬A= )
+ 連言(れんげん) :: ~A and B~ 相当。変数や式同士の間に =∧= という記号を挿入する ( =A ∧ B=)
+ 選言(せんげん) :: ~A or B~ 相当。変数や式同士の間に =∨= という記号を挿入する (=A ∨ B=)
+ 含意(がんい) :: 変数 2 つと演算子で表現できる適切な Python コードでの表現が筆者には思いつかない。変数や式が真に成ると別の変数や式が真になる事を表す (=A ⇒ B=)
+ 同値(どうち) :: ~B==A~ 相当。変数や式同士が真と成る事を表す (=A ⇔ B=)


また、読者にとって余計な世話と思うが、ブール値に関しても書き加えておく:

- [[https://docs.python.org/ja/3/library/stdtypes.html#boolean-values][ブール値]]
  + 真(しん) :: ~True~ 相当。数理論理学の真理表では ~1~ という文字で表す事も多い。また、省略で ~t~, や ~T~ の文字で表す事もある。
  + 偽(ぎ) :: ~False~ 相当。数理論理学の真理表では ~0~ という文字で表す事も多い。また、省略で ~f~, や ~F~ の文字で表す事もある。


もう一つ余計なお世話で、表にしてみる。

| 日本語 | よみ     | 記号 | in Python |
|--------+----------+------+-----------|
| 真     | しん     |      | ~True~    |
| 偽     | ぎ       |      | ~False~   |
| 否定   | ひてい   | ¬    | ~not~     |
| 連言   | れんげん | ∧    | ~and~     |
| 選言   | せんげん | ∨    | ~or~      |
| 含意   | がんい   | ⇒    |           |
| 同値   | どうち   | ⇔    | ~==~      |


もし他の結合子を定義したいと思ったならば、一度その言葉や概念をまず 2 つくらいに分割できないか、そして分割した物がさらに分割できないかと割っていく。
そうやって切り刻んでいくと、最後にはこれらの論理結合子で表せる物が組み合わされているものになる /はずだ/ なお、これを _複合命題_ や _複合述語_ という。

** 述語と量化子とラムダ式
少し変っていると読者に思われるかもしれないが、筆者個人が衝撃を受けたと形容する位には感動した事なのでこれも特筆させて頂く。

上記でも事足りるには足りるが、「すべての……は……である」や「ある……は……である」という日本語での表現を、個人的にはとても短かく表すのに都合の良いものがある。
それが *量化* である。

- 全称(ぜんしょう)「すべての……」 :: =∀= という記号を頭に大きく付ける。その右下に変数や式が代入される。
- 存在(そんざい)「ある……」 :: =∃= という記号を頭に大きく付ける。その右下に変数や式が代入される。

ところでこの量化の記号、 _量化子_ を実際に TeX 等で書いていたが、著者が TeX 式の出力方法が思い付かなかったので、申し訳ないが省く。

ただ、この量化子を用いた論理式を眺めて筆者は「[[https://ja.wikipedia.org/wiki/%E3%83%A9%E3%83%A0%E3%83%80%E8%A8%88%E7%AE%97][ラムダ式]]みたいだなあー」と思った訳である。
/TeX で式を書いて「当然だわ。『記号の右下に変数が付いてる』のだもの」と書いて気づいたが/

実の事を言うと、述語の説明・定義の時点で「チャーチ数の様だ」と思う人が居るとは思うが、
筆者が「述語はチャーチ数みたいだな」と感じたのは量化子の説明を読んだ後で述語の説明を読み直した時である。

なお、ラムダ計算ではチャーチ数という概念で自然数を定義する。詳しくは自分が TeX のコード出力に手間取っているよりは、
[[https://tarao.hatenablog.com/entry/20100208/1265605429][ラムダ計算基礎文法最速マスター | 貳佰伍拾陸夜日記]] の「自然数」の節をご覧頂くのが早いだろう。


** 与太話: 全称記号と 2000 年代の日本のインターネッツ
全称の記号 =∀= の記号を見て、 \\
「顔文字の口みたい」 \\
と思われた方が居れば、おそらく同世代なのだろうと筆者は推測する。

筆者は「匿名掲示板 2 ちゃんねる」に出入りする様な度胸を持ち合わせていないものの、
当時の Flash アニメで「[[https://ja.wikipedia.org/wiki/%E3%83%A2%E3%83%8A%E3%83%BC][モナー]]」の存在は知っていたモナ（´∀｀）

ところで、モナのよく使う煽り文句で、 \\
「オマエモナー」 \\
っていうのがあるモナ（´∀｀）

全称の意味が「すべて」の意だから、何か言われたモナたちが、 \\
「オマエモナー（´∀｀）」 \\
って煽るのは、モナもモナに文句を言ってきた人も⇒すべての人が該当する。

という自嘲と皮肉なんだモナ（´∀｀）

……という話 *全くない*  。上記は筆者の言葉と記号の関連付けで遊んだ散文である。

** 閑話休題: ここまでのまとめ
ここまで書き上げるのに 2 日(14 時間)も費してしまったのではあるが、

- 「数学」という言葉の曖昧さ
- 「論理学」という「具象を抽象化し真偽に分ける」道具
- 「数理論理学」という「数学」と「論理学・哲学」の混合概念で上手く行くかもしれないこと
  - 日常会話の解釈
  - 書物や Web 上の記事の読み解き
  - その他、問題の分析や整理

という事が読者に伝わっていれば、感謝したいくらい幸いだ。

* 「しかしそれは薄情・無情では無いか？」
論理的な文章もしくは言い回しには、どうも血の通っていない印象を持たれるらしい。

少なくとも、筆者個人から見ての他者同士の会話において、片側がまたもう片側からの比較的理路整然とした指摘に対して、 \\
「偉そうですね」だったり「どうしてそんなに冷たいのですか？」 \\
という感想を見聞きする事が、筆者の体験上でとても多い。

また、もしここまでの筆者の御託というのか感想文に \\
「偉そう」 \\
という感想を抱かれたなら、それは筆者の語彙だったり言葉選びが幼稚であるためだ。容赦頂きたい。

** バートランド・ラッセルの語録
しかしながら、筆者は今回この記事を書くにあたってバートランド・ラッセルという人物の事を始めて知ったも同然なのではあるが、
[[https://ja.wikipedia.org/wiki/%E3%83%90%E3%83%BC%E3%83%88%E3%83%A9%E3%83%B3%E3%83%89%E3%83%BB%E3%83%A9%E3%83%83%E3%82%BB%E3%83%AB][Wikipedia の氏のページ]]の語録の章に興味深いものがあったので 2 つ紹介させて頂く。

*** 悪の定義と、悪の側からの「正義」という詭弁と正当化
#+BEGIN_QUOTE
高潔な人たちが、自分は正当にも「道徳的な悪」を懲らしめているのだと思いこんで行ってきた'戦争'や'拷問'や'虐待'のことを考えると、私は身震いする。
#+END_QUOTE
/On Education, 1926 より/

特別筆者が語る必要は無いだろう。完全に筆者の偏見に因るものだが、 \\
「正義」の名の元に'戦争'や'拷問'や'虐待'を行う人達は、 \\
「自分の地位や名誉や権利や生存とそれらの存続」 \\
に危機や不安を覚えるから、 \\
「先にそれらを奪う可能性のある存在を潰してしまおう」 \\
あわよくば、 \\
「その存在を『自分の地位や名誉や権利や生存とそれらの存続』について肯定する存在に変えてしまおう」 \\
とするのだ。

こう述べるとさも筆者が、 \\
「俗に塗れぬ者」 \\
と捉える読者が居るかもしれないが、全くもってそんなことはない。 \\
「地位や名誉や権利や生存とそれらの存続」 \\
は、生き物の性であり、またミーム学ごっこの考え方をこじつけてしまえば「情報そのもの」もその存在の存続を脅かす
存在が居ると認識するならば、駆逐・殲滅するのであろう。とは思う。ただし、ここまでは殺人癖の類いに関しては扱わないものとする。

さて、ここまで述べた、むしろ戯けて置いて、筆者が何もラッセル氏の引用に対しての反論や同感などは述べていないと思う。

筆者も実体験での実感を元に「身震い」する。しかし、ここでは実体験の詳細は省く。

ただ、その筆者自身の体験や感覚に至る認知・クオリアを誤差なく伝える事は叶わない。
なので高潔を自称する人々に筆者が偉そうに、 \\
「貴様達も己等が如何に動物・生物的な価値の押しつけをしているのか自覚を持て」 \\
と宣うのもまた価値感の押しつけどころか、それこそ生物の生存存続の価値に従っての独り善がりでしかない。

であるならば……いや、もうこれ以上戯けても、 \\
「俺は暗くてジメジメしてカビ臭くてキノコが生えている様な所でも生きるよ」 \\
という今現時点での所感に着地する。


*** とは言え、「不幸な人間」が「不幸」を解くには
#+BEGIN_QUOTE
「不幸な人間は、いつも自分が不幸であるということを自慢しているものです」
#+END_QUOTE
/出典不明/

先程、
「俺は暗くてジメジメしてカビ臭くてキノコが生えている様な所でも生きるよ」 \\
と述べておきならが、このラッセルの語録はとても胸に刺さる。
心臓をマチェットナイフで突き刺されたのではなかろうかというくらいに。

そして、自称不幸さなら周りの人間の誰にも負けないという
下らない囚人の足枷の自負にエクスタシーを感じがちな筆者は、いい加減その不幸自慢が
周りに不快感を与えている様子なのをようやく察した訳である。

ただ、その不幸の原因や問題に対しては全く論理的な観察・分析が進んでいなかったから、
不幸自慢をするしか無かったとは、言い訳する。


* まとめ: 論理学を薦める、とても感情に偏った理由
果たしてこんな現世は人の型をした畜生の学習開始感想文をここまで読んでいる人はもう居ないのではなかろうかと
思いながら書いているのではあるが、この記事で何を言いたかったのか筆者自身がこの記事と、
記事にする前の殴り書きを見返して箇条書きして締めよう。

- 問題(個人の悩みから社会の問題まで)の基本となる分解方法を知る事ができる
- 自分はもちろん他人に物事を伝える時の基本を知る事ができる
- その上で、自分自身を含めた個々人の背景理解や事象理解を行う事が比較的楽になる(かもしれない)


* 蛇足
以下、ただでさえクソ長い上に支離滅裂だろうこの記事に数個書きたかった事について書いておく。

** 筆者の認知特性
[[https://overpass.dokkoisho.com/cognitive/][こちらの「認知特性テスト」]]による筆者の認知特性を見せた方が良いと筆者個人としては思ったので結果を貼りつけておく。
# あとでここに画像を

** 言葉を『解く』為の「論理学」「哲学」
論理や認知の話で「サピア・ウォーフの仮説」の話を絡めて、
ロジバンやグロービッシュについても語りたかったが、話の展開があまりにも不自然であったので、
蛇足で語らせて頂く。

簡単に言えば、 \\
「言葉が違うと物事の捉え方も変わるのでは？」
という仮説と、その説の検証として「ログラン」という言語とそれを発展させた「ロジバン」が在ったり。

また、英語の名詞・固有名詞以外の語彙を少なくした英語として「ベーシック英語」というものが在り、
これを利用してプログラミングでの関数やメソッドの命名に使うのも在りという話があったり。

また「エスペラント」という言語も興味深いと思う。

いずれにせよ、どの言語で書かれていても、その書かれたものの著者の背景理解だったり、
論理的解釈は必要なのだが、 多少はこういう言語の方が論理面の解釈や背景理解に
あたっての負荷が低いのではなかろうかと、 10 年前から思ってしまっている所存ではある。

興味が湧いた方は是非調べて頂けると幸いである。


* 参考資料
- 著:山田俊行 森北出版 「はじめての数理論理学 証明を作りながら学ぶ記号論理の考え方」| ISBN978-4-627-07801-7
- [[https://tarao.hatenablog.com/entry/20100208/1265605429][ラムダ計算基礎文法最速マスター | 貳佰伍拾陸夜日記]]


* 謝辞
この投稿の初稿に対するレビューを「興味があれば」とザツに頼んだにも関わらず、
至極冷静に指摘をくれた D.O 氏には有り難く感謝を申し上げたい。

また、多忙かつ筆者のこんな下らない感動の感想文にも肯定的に、  
「読むよ!」  
と返答をしてくれた、かげぎす氏にも感謝申し上げたい。


* 変更履歴

- 2021-04-28 :: 残存していた乱文(マークアップミス)を修正。
- 2020-10-04 :: 乱文かつ草書(書いていない箇所も多々存在)を公開。
- 2020-10-25 :: まともな文書に初稿。その際には TeX コードや数式は図等への出力が筆者個人の力量では適わなかったため削除。


