ToCrieit/MathLogic/learning_about_logic.md


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> 「逢った」という表現に「誤用では？」と感ずる読者が大多数と筆者は思うが、これには、
「存在した」ではなく「筆者が求めて **ではなく** あちらから切っ掛けが **来た** 」という言外の意図を表したく、この様な表現にした。

<sup><a id="fn.2" href="#fnr.2">2</a></sup> この記事では「ニュアンス」と言った方がよっぽど伝わり易いと思われる筆者の心情をあえて「言外の意図・意味」と書いている。
筆者自身への「ニュアンス」という言葉による「書き出さない、書き出し難い意図や意味」の省略を避けたい戒めである。

<sup><a id="fn.3" href="#fnr.3">3</a></sup> 書物や記事によっては「函数」と表記される事もあるので、改めて意味を調べた。どちらも同じ物を指すものの、これまた言外の意味を
筆者個人が感じたので脚注で戯けさせていただくと;

-   **関数:** 「関」という字の意味としては「境目」や「出入口」
-   **函数:** 「函」という字の意味としては「箱」や「入れ物」

の様に受け取れた。

幼稚だが [Wikipedia の名称表記の歴史](https://ja.wikipedia.org/wiki/%E9%96%A2%E6%95%B0_(%E6%95%B0%E5%AD%A6)#%E5%90%8D%E7%A7%B0%E8%A1%A8%E8%A8%98%E3%81%AE%E6%AD%B4%E5%8F%B2)を掻い摘んで見れば、

> 日本語としての関数はもともと「函数」（旧字体では函數）と書く。函数という語は中国語から輸入されたものであり、中国での初出は 1859 年に出版された李善蘭の『代微積拾級』といわれる。
> 
> (…中略…)
> 
> なお、現代の初等教育の場においてはしばしば関数をブラックボックスのたとえで説明することがある[2][11][12]。この説明では、「函」を「はこ」と読むことと関連付けて説明されることもあるが、「函数」の語の初出は 1859 年なのに対し、「ブラックボックス」の語の初出は 1945 年ごろとされることに注意を要する。

誠に個人の感想だが、「『入力・出力の値』に対しての関心・着眼が『関数』」、「入力・出力が出入りする『箱そのもの』への関心・着眼が『函数』」と書かせるのかもしれないと感じた。

どちらにせよ、入力・処理そのもの(ブラックボックスでも)・出力のひとまとまりを述べる言葉には変り様は無いと思うので、   
「よっぽどブラックボックスに関心・着目をさせたいのであれば『函数』と書いても一興かも」   
というのが筆者の感想であるし、関心の対象が「数学」なのか「哲学・論理学」かでもボヤけてしまう話と筆者は感じるので、   
「この論争は人間の認知・クオリアが画一の物を誤差なく共有できない限りは解決しないだろう」   
と [Wikipedia を見て](https://ja.wikipedia.org/wiki/%E3%83%97%E3%83%AD%E3%82%B8%E3%82%A7%E3%82%AF%E3%83%88:%E6%95%B0%E5%AD%A6/%E5%87%BD%E6%95%B0%E3%81%A8%E9%96%A2%E6%95%B0)思ってしまうのである。

<sup><a id="fn.4" href="#fnr.4">4</a></sup> 「流行り」と解してしまうのは良くないのかもしれないし、筆者個人も [LISP](http://landoflisp.com/) や ML, [Haskell](https://www.haskell.org/), [OCaml](https://ocaml.org/) が出た当初や
その後暫くの業界での利用例や学術記事の増減を見た訳でもない。
良くて 2015 年頃に Haskell が盛り上がって [Scala](https://scala-lang.org/) が盛り上がり、[Elixir](https://elixir-lang.jp/) や [Crystal](https://crystal-lang.org/) や [Haxe](https://haxe.org/) だったり [Rust](https://www.rust-lang.org/ja/) の誕生で筆者の観測している界隈で賑わったり……」
という筆者個人の肌感覚しか持ち合わせていない。

<sup><a id="fn.5" href="#fnr.5">5</a></sup> 書籍では老先生の「ラッセル卿の『1+1=2』の証明」の写しは手書きの書体で記されていた *図と明確に判る様にと載せたと思われる* 。興味のある読者は、
「[Wikipedia 日本語版の『プリンキピア・マテマティカ』の『引用』](https://ja.wikipedia.org/wiki/%E3%83%97%E3%83%AA%E3%83%B3%E3%82%AD%E3%83%94%E3%82%A2%E3%83%BB%E3%83%9E%E3%83%86%E3%83%9E%E3%83%86%E3%82%A3%E3%82%AB#%E5%BC%95%E7%94%A8)の節をご覧頂ければ幸いである。
